{
  "payload": {
    "repositoryURL": "https://github.com/nasa/PeTaL",
    "homepageURL": "https://github.com/nasa/PeTaL",
    "downloadURL": "",
    "disclaimerURL": "",
    "laborHours": 1000,
    "languages": [
      "JavaScript",
      "Python",
      "HTML",
      "CSS",
      "XML",
      "JSON",
      "Sass"
    ],
    "name": "PeTaL",
    "contributors": [
      {
        "name": "Herb Schilling",
        "email": "hschilling@nasa.gov",
        "github": "hschilling"
      }
    ],
    "tags": [
      "biomimicry",
      "design",
      "tool",
      "webapp",
      "nature-inspired"
    ],
    "description": "The Periodic Table of Life (PeTaL, pronounced petal) is intended to be a design tool to enable a deeper understanding of natural systems and to enable the creation or improvement of nature-inspired systems. The tool includes an unstructured database, data analytics tools and a web-based user interface. Three levels of information are expected to be captured: morphology that would aid designers by providing context-specific physical design rules, function-morphology relationships to provide nature-inspired solution strategies, and system-level relationships that involve the interaction of several biological models including flow of resources and energy. In its current form, PeTaL is structured as a large NoSQL database that will be accessible to researchers and citizen scientists. It includes entomological and paleontological data from the Cleveland Museum of Natural History (CMNH) in Cleveland, OH, the Cincinnati Museum Center in Cincinnati, OH and the Smithsonian. PeTaL can display relationships between biological models, geography, and environment through maps and plots. These may be used to glean patterns or design rules. Data can also be downloaded for further analysis. A more systematic design process is under development that will allow multiple models to be used for the various stages of design.",
    "contact": {
      "email": "vikram.shyam-1@nasa.gov",
      "name": "",
      "phone": "",
      "URL": ""
    },
    "date": {
      "lastModified": "2019-11-29",
      "metadataLastUpdated": "2019-11-29",
      "created": "2019-11-29"
    },
    "organization": "GRC",
    "permissions": {
      "licenses": [
        {
          "name": "NASA Open Source",
          "URL": "https://opensource.org/licenses/NASA-1.3"
        }
      ],
      "usageType": "openSource",
      "exemptionText": null
    }
  },
  "contact_email": "PqKMw3oNg0HUFAQexNQlkqKc0l837g6BTf5477i7KZ6MpUo=",
  "nonce": "nvSoqaqHPclpfqXHUcYHG5+D23X1Etez"
}