{
  "payload": {
    "repositoryURL": "https://github.com/NASA-DEVELOP/MARSHe",
    "description": "This tool includes three general types of scripts. The first one extracts average NDVI values from Landsat 5 and Landsat 8 image collections for specified reference dates (typically a period of 10-15 years). Anomalies in NDVI values are then derived from Landsat 5 & 8 reference image collections from later dates (typically the year after the reference period to present). Various graphs and charts are produced showing positive and negative NDVI changes for specified points. The results are also visualized on the map as either areas of NDVI gain (displayed in green) or NDVI loss (displayed in red). The second types of scripts included scripts that perform unsupervised classifications to determine marsh extent for a variety of years and were made by applying a mask over the specified study area that incorporates elevation data to exclude regions over a specified height above average sea-level. These scripts require the user to choose classified pixel clusters that represent marsh land cover by using the Google Earth Inspector tab and then entering those values into the script to generate the marsh extent maps. Results of these scripts include classification maps for various years (2000, 2005, 2010, 2015, etc.). The user can then decide to export those results into either their Assets or their Drive, or both. A third type of script is used for statistics regarding the classified maps generated in the classification scripts. These statistics include total pixel number and total marsh area calculated into square meters after the marsh extent pixels are clipped to our study area (the State of Maryland).",
    "contributors": [
      {
        "name": null,
        "email": "larc-sra@mail.nasa.gov",
        "github": null
      }
    ],
    "tags": [
      "marsh",
      "remote",
      "sensing",
      "health",
      "evaluation",
      "Landsat 5",
      "Landsat 8",
      "image",
      "usg-artificial-intelligence"
    ],
    "name": "MaRSHE- Marsh Remote Sensing Health Evaluation",
    "contact": {
      "email": "larc-sra@mail.nasa.gov",
      "name": "",
      "phone": ""
    },
    "laborHours": 16,
    "date": {
      "lastModified": "2020-09-01",
      "metadataLastUpdated": "2020-09-02",
      "created": "2018-08-21"
    },
    "organization": "LaRC",
    "homepageURL": "https://software.nasa.gov/software/LAR-19211-1",
    "local-id": "d8f07c45-96e2-46dd-b14d-634826a11e5d",
    "permissions": {
      "licenses": [
        {
          "name": "NASA Open Source",
          "URL": "https://opensource.org/licenses/NASA-1.3"
        }
      ],
      "usageType": "openSource",
      "exemptionText": null
    },
    "supplementaryURLs": [],
    "languages": [
      "JavaScript"
    ],
    "disclaimerURL": "https://example.com",
    "sti_keywords_passed_thresholds": [
      "nlp:classification",
      "nlp:thematic mapping",
      "nlp:digital data",
      "nlp:remote sensing",
      "nlp:earth surface",
      "nlp:anomaly",
      "nlp:satellite imagery",
      "nlp:brazil",
      "nlp:map",
      "nlp:land use"
    ],
    "service_version": "4.1.1",
    "date_AI_tags": "2019_October_03_at_03_15PM",
    "downloadURL": "https://github.com/NASA-DEVELOP/MARSHe/archive/master.zip"
  },
  "contact_email": "uoiGeb+VuD9h1J9J9nuZoLwtZhZzeA2QQ7sHiU0JHo93hX63YKyyPg==",
  "nonce": "DIMhEsGkIf8bSXaVv8PgrJPjQ3hQv6N7"
}