{
  "payload": {
    "repositoryURL": "https://github.com/nasa/puma",
    "homepageURL": "",
    "downloadURL": "",
    "disclaimerURL": "",
    "laborHours": 1000,
    "languages": [
      "Python",
      "C++"
    ],
    "name": "PuMA",
    "contributors": [
      {
        "name": "Federico Semeraro",
        "email": "federico.semeraro@nasa.gov",
        "github": "fsemerar"
      }
    ],
    "tags": [
      "computational-physics",
      "tomography",
      "image-processing"
    ],
    "description": "The Porous Microstructure Analysis (PuMA) software has been developed to compute effective material properties and perform material response simulations on digitized microstructures of porous media. PuMA is able to import digital three-dimensional images obtained from X-ray microtomography or to generate artificial microstructures that mimic real materials. PuMA also provides a module for interactive 3D visualizations. Version 3 includes modules to compute simple morphological properties such as porosity, volume fractions, pore diameter, and specific surface area. Additional capabilities include the determination of effective thermal and electrical conductivity (both radiative and solid conduction - including the ability to simulate local anisotropy for the latter); effective diffusivity and tortuosity from the continuum to the rarefied regime; techniques to determine the local material orientation, as well as the mechanical properties (elasticity coefficient), and the permeability of a material.",
    "contact": {
      "email": "federico.semeraoro@nasa.gov",
      "name": "Federico Semeraro",
      "phone": "",
      "URL": ""
    },
    "date": {
      "lastModified": "2021-09-22",
      "metadataLastUpdated": "2021-09-23",
      "created": "2018-01-01"
    },
    "organization": "ARC",
    "permissions": {
      "licenses": [
        {
          "name": "NASA Open Source",
          "URL": "https://opensource.org/licenses/NASA-1.3"
        }
      ],
      "usageType": "openSource",
      "exemptionText": null
    }
  },
  "contact_email": "e1FTQ8CT0UASq+W2eXgwpPEAECiXLiiwhrNnIxlWOmUCCVilHpAE+6bFZA==",
  "nonce": "534Vh+sM1IkpbJ7jxpeyCCGQeUjJBpIL"
}