{
  "payload": {
    "repositoryURL": "https://github.com/nasa/GHRC-FieldCampaign-eXplorer-core",
    "homepageURL": "",
    "downloadURL": "https://github.com/nasa/GHRC-FieldCampaign-eXplorer-core/archive/refs/heads/main.zip",
    "disclaimerURL": "",
    "laborHours": 2000,
    "languages": [
      "Python"
    ],
    "name": "GHRC-FieldCampaign-eXplorer-core",
    "contributors": [
      {
        "name": "Navaneeth Selvaraj",
        "email": "navaneeth.rangaswamyselvaraj@nasa.gov",
        "github": "navaneethrs"
      }
    ],
    "tags": [
      "Python",
      "AWS",
      "ZAPPA",
      "Tile server",
      "Cesium"
    ],
    "description": "The Field Campaign eXplorer (FCX) is developed at the Global Hydrometeorology Resource Center (GHRC) to address data exploration needs in portraying the interactive nature of multiple datasets that are obtained in a concerted field campaign.\n\nThe FCX has been built to explore the diverse multi-stream coincident datasets through several field campaigns whose data are managed and archived at GHRC. FCX is a web-based and cloud-native system that visualizes multiple datasets in a time-dynamic, 3-dimensional display with supplemental data analysis. The web-based feature delivers visualization without the requirement of a graphical software system and being cloud-native allows for sharing of the data and visualization.\nFCX offers a system for coincident visualization and analysis. Scientific analysis typically requires intercomparisons and cross-references. This enables the investigation of the environment and how individual observations come together to explain the larger whole. FCX offers a means with which to more readily bring together many, often disparate, datasets in a common frame of reference without requiring the user to develop these capabilities. Further, as more data become publicly available in the cloud, FCX’s open source abilities facilitate not only cross-DAAC collaborations but ultimately cross-organization collaborations.",
    "contact": {
      "email": "will.ellett@nasa.gov",
      "name": "Will Ellett",
      "phone": 2569617808,
      "URL": ""
    },
    "date": {
      "lastModified": "2022-02-17",
      "metadataLastUpdated": "2022-02-17",
      "created": "2015-10-01"
    },
    "organization": "MSFC",
    "permissions": {
      "licenses": [
        {
          "name": "Apache-2.0",
          "URL": "https://opensource.org/licenses/Apache-2.0"
        }
      ],
      "usageType": "openSource",
      "exemptionText": null
    }
  },
  "contact_email": "7xRsk1an7d9EHcEyAWqQ1LBag7mlYnMwvsaGdjyJuT9EOb1o0SOASzbL7csOWLtvrxKZO5E=",
  "nonce": "/hgM/+kN75FHE/NIl1Dpcldyd0p47mCB"
}