{
  "payload": {
    "repositoryURL": "https://github.com/nasa/svrstormsig",
    "homepageURL": "",
    "downloadURL": "https://github.com/nasa/svrstormsig.git",
    "disclaimerURL": "",
    "laborHours": 480,
    "languages": [
      "Python"
    ],
    "name": "svrstormsig",
    "contributors": [
      {
        "name": "John Cooney",
        "email": "john.w.cooney@nasa.gov",
        "github": "cooneyj023"
      },
      {
        "name": "Charles Liles",
        "email": "charles.a.liles@nasa.gov",
        "github": "Charles-Liles"
      },
      {
        "name": "Kristopher Bedka",
        "email": "kristopher.m.bedka@nasa.gov",
        "github": "N/A"
      }
    ],
    "tags": [
      "usg-artificial-intelligence",
      "NASA",
      "AACP",
      "OT",
      "severe-storm-signatures",
      "overshooting-top",
      "above-anvil-cirrus-plume",
      "geostationary-satellite",
      "LaRC"
    ],
    "description": "Severe weather clouds exhibit distinct patterns in satellite imagery. These patterns, commonly referred to as overshooting cloud tops (OTs) and above anvil cirrus plumes (AACPs), are routinely observed by the human-eye in satellite imagery atop the most intense storms on Earth. With the latest geostationary high spatio-temporal resolution satellite imagers such as, GOES-16 and GOES-17, these severe weather patterns are being observed better than ever before. Advances in deep learning methods allow us to not only detect these signatures but also automate the detection process for real-time applications. Our software code was developed in Python and contains up to 3 model types, U-Net, MultiResU-Net, and AttentionU-Net with varying geostationary satellite channels used as model inputs. The MultiresU-Net model has been found to identify the severe storm signatures better than the other 2 model types and will likely be the only model packaged in the software release. The models' were trained using a large database of OT and AACP patterns identified from human analysts based on 1-minute GOES-16 ABI imagery. In testing, the models have been shown to successfully detect OTs and AACPs with high precision. The software has also successfully been run for real-time and archived applications. The goal of this software is for users to accurately detect these severe storm signatures for a variety of forecast and research applications.",
    "contact": {
      "email": "john.w.cooney@nasa.gov",
      "name": "John Cooney",
      "phone": "",
      "URL": ""
    },
    "date": {
      "lastModified": "2023-05-11",
      "metadataLastUpdated": "2023-05-11",
      "created": "2018-06-01"
    },
    "organization": "LaRC",
    "permissions": {
      "licenses": [
        {
          "name": "NASA Open Source",
          "URL": "https://opensource.org/licenses/NASA-1.3"
        }
      ],
      "usageType": "openSource",
      "exemptionText": null
    }
  },
  "contact_email": "eHKsCO8hmBsmXFCc0ega0b+F5s0U/x+Ph9687pMHNO/NTT+yFBQ=",
  "nonce": "vezN5/rDM6zUeSsCwJ405cYInMVVZhnD"
}