{
  "payload": {
    "repositoryURL": "https://github.com/nasa/Generic-Urban-Air-Mobility-GUAM",
    "homepageURL": "https://nari.arc.nasa.gov/ttt-ram/community",
    "downloadURL": "https://github.com/nasa/Generic-Urban-Air-Mobility-GUAM",
    "disclaimerURL": "https://github.com/nasa/Generic-Urban-Air-Mobility-GUAM",
    "laborHours": 4000,
    "languages": [
      "C++",
      "C",
      "Matlab/Simulink"
    ],
    "name": "Generic-Urban-Air-Mobility-GUAM",
    "contributors": [
      {
        "name": "Michael Acheson",
        "email": "michael.j.acheson@nasa.gov",
        "github": "macheson1"
      }
    ],
    "tags": [
      "Autonomous Flight",
      "Urban Air Mobility",
      "Advanced Air Mobility",
      "eVTOL"
    ],
    "description": "The generic Urban Air Mobility (GUAM) github repository is a NASA created Matlab®/Simulink® simulation whose focus is to provide access for the Urban Air Mobility (UAM) and Advanced Air Mobility (AAM) research communities to a complete six degree-of-freedom, non-linear, single rigid-body simulation architecture to facilitate perception, control and machine learning research focused on autonomous flight of novel aircraft configurations.  The release of this simulation framework is intended to overcome barriers to collaboration and exchange within the eVTOL autonomous flight research community.\nAdditionally, the GUAM simulation is the basis for collaboration/comparison of a series of Challenge Problems posed to the autonomous flight research community.  These problem series are sets of increasing difficult autonomous flight tasks (e.g., trajectory tracking, stationary obstacle avoidance, moving intruder avoidance, vehicle control effector failure detection and mitigation).  The challenge problems will be a rolling set of challenges including performance assessment metrics, which allows researchers to baseline and assess the state of the art in autonomous transition vehicle flight using common vehicles and simulation framework.\n",
    "contact": {
      "email": "michael.j.acheson@nasa.gov",
      "name": "Michael Acheson",
      "phone": null,
      "URL": ""
    },
    "date": {
      "lastModified": "2024-05-22",
      "metadataLastUpdated": "2024-05-22",
      "created": "2022-09-01"
    },
    "organization": "LaRC",
    "permissions": {
      "licenses": [
        {
          "name": "NASA Open Source",
          "URL": "https://opensource.org/licenses/NASA-1.3"
        }
      ],
      "usageType": "openSource",
      "exemptionText": null
    }
  },
  "contact_email": "UtiTOcRj1SLw0rvOJ/YVn/rEo6HcJE2m7jPq35jW+L8DlRdukJBuNaQ6",
  "nonce": "uDj2uJct+ueTuARcICdj6AY/lQbpnEsR"
}